docs/jmeter/statistics.json
{
  "GET /api/products" : {
    "transaction" : "GET /api/products",
    "sampleCount" : 120,
    "errorCount" : 31,
    "errorPct" : 25.833334,
    "meanResTime" : 385.2083333333332,
    "medianResTime" : 298.5,
    "minResTime" : 1.0,
    "maxResTime" : 1421.0,
    "pct1ResTime" : 934.5,
    "pct2ResTime" : 1056.1499999999999,
    "pct3ResTime" : 1412.3899999999996,
    "throughput" : 1.7304530903008106,
    "receivedKBytesPerSec" : 25.54575741571251,
    "sentKBytesPerSec" : 0.2179965318835982
  },
  "GET /api/products/:id (detail)" : {
    "transaction" : "GET /api/products/:id (detail)",
    "sampleCount" : 120,
    "errorCount" : 31,
    "errorPct" : 25.833334,
    "meanResTime" : 355.37499999999994,
    "medianResTime" : 271.0,
    "minResTime" : 1.0,
    "maxResTime" : 1069.0,
    "pct1ResTime" : 895.9000000000001,
    "pct2ResTime" : 945.3999999999999,
    "pct3ResTime" : 1062.2799999999997,
    "throughput" : 1.7367392720167885,
    "receivedKBytesPerSec" : 2.7133583064982996,
    "sentKBytesPerSec" : 0.2628853390259787
  },
  "GET /api/products/new" : {
    "transaction" : "GET /api/products/new",
    "sampleCount" : 120,
    "errorCount" : 35,
    "errorPct" : 29.166666,
    "meanResTime" : 305.05000000000007,
    "medianResTime" : 212.0,
    "minResTime" : 1.0,
    "maxResTime" : 1056.0,
    "pct1ResTime" : 830.7,
    "pct2ResTime" : 929.7499999999995,
    "pct3ResTime" : 1052.0099999999998,
    "throughput" : 1.7430206547947593,
    "receivedKBytesPerSec" : 15.480329853041571,
    "sentKBytesPerSec" : 0.22638842489033495
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 480,
    "errorCount" : 129,
    "errorPct" : 26.875,
    "meanResTime" : 695.2625000000008,
    "medianResTime" : 353.5,
    "minResTime" : 1.0,
    "maxResTime" : 3898.0,
    "pct1ResTime" : 2395.5,
    "pct2ResTime" : 3113.7,
    "pct3ResTime" : 3513.3599999999997,
    "throughput" : 6.503888783501802,
    "receivedKBytesPerSec" : 43.025780763055195,
    "sentKBytesPerSec" : 1.0321112571475026
  },
  "POST /api/auth/login" : {
    "transaction" : "POST /api/auth/login",
    "sampleCount" : 120,
    "errorCount" : 32,
    "errorPct" : 26.666666,
    "meanResTime" : 1735.416666666667,
    "medianResTime" : 2012.0,
    "minResTime" : 1.0,
    "maxResTime" : 3898.0,
    "pct1ResTime" : 3313.6000000000004,
    "pct2ResTime" : 3500.7999999999993,
    "pct3ResTime" : 3897.79,
    "throughput" : 1.7247326664367024,
    "receivedKBytesPerSec" : 2.165319892994711,
    "sentKBytesPerSec" : 0.3924440539841325
  }
}